2CylRe75/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    TOP
    {
        type                      zeroGradient;
    }
    BOTTOM
    {
        type                      zeroGradient;
    }

    SIDE1
    {
        type                      zeroGradient;
    }
    SIDE2
    {
        type                      zeroGradient;
    }

    INLET
    {
        type                      zeroGradient;
    }

    OUTLET
    {      
        type                       fixedValue;
        value                      uniform 0;
    }

    PRISM1
    {
        type                      zeroGradient ;
    }
	
	PRISM2
    {
        type                      zeroGradient ;
    }
}
// ************************************************************************* //
